Autodesk.Revit.UI.ExternalDataManagerCommand.RegisterCommand(Autodesk.Revit.UI.ExternalDataManagerCommand)
Registers a command.
Remarks:
This overload is intended to be used by external servers that already
have a fully-constructed ExternalDataManagerCommand instance. The
service copies the supplied metadata and adds the command to the global
registry.
command:
The command to be registered.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerCommand.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.ExternalDataManagerCommand.Executable
Indicates if the command is executable.
Remarks:
The default value is true.
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerCommand.SupportMultiItems
Indicates if the command support manipulate multiple items in one execution.
Remarks:
The default value is false.
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerCommand.Tooltip
The tooltip of the command.
Remarks:
The tooltip will be shown in UI, so it should be localized.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerCommand.Name
The name of the command.
Remarks:
The command name will be shown in UI, so it should be localized.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerCommand.Id
The id of the command.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerCommand.#ctor(Autodesk.Revit.UI.ExternalDataManagerCommandId)
Constructor
id:
The id of the command.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerCommand.#ctor(Autodesk.Revit.UI.ExternalDataManagerCommand)
Create a copy of the object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerCommand
Represents the commands that an IExternalDataManagerServer supports.
Remarks:
Represents the commands that a IExternalDataManagerServer supports.
Since:
2027